{
  "adaptive_patching_levels": 0,
  "architectures": [
    "TinyTimeMixerForPrediction"
  ],
  "categorical_vocab_size_list": null,
  "context_length": 30,
  "d_model": 32,
  "decoder_adaptive_patching_levels": 0,
  "decoder_d_model": 16,
  "decoder_mode": "common_channel",
  "decoder_num_layers": 8,
  "decoder_raw_residual": false,
  "distribution_output": "student_t",
  "dropout": 0.1,
  "dtype": "float32",
  "enable_forecast_channel_mixing": false,
  "exogenous_channel_indices": null,
  "expansion_factor": 2,
  "fcm_context_length": 1,
  "fcm_gated_attn": true,
  "fcm_mix_layers": 2,
  "fcm_prepend_past": true,
  "fcm_prepend_past_offset": null,
  "fcm_use_mixer": false,
  "frequency_token_vocab_size": 5,
  "gated_attn": true,
  "head_dropout": 0.1,
  "huber_delta": 1,
  "init_embed": "pytorch",
  "init_linear": "pytorch",
  "init_processing": true,
  "init_std": 0.02,
  "loss": "mse",
  "mask_value": 0,
  "masked_context_length": null,
  "mode": "common_channel",
  "model_type": "tinytimemixer",
  "norm_eps": 1e-05,
  "norm_mlp": "LayerNorm",
  "num_input_channels": 4,
  "num_layers": 3,
  "num_parallel_samples": 100,
  "num_patches": 15,
  "patch_last": true,
  "patch_length": 2,
  "patch_stride": 2,
  "positional_encoding_type": "sincos",
  "post_init": false,
  "prediction_channel_indices": null,
  "prediction_filter_length": 7,
  "prediction_length": 7,
  "quantile": 0.5,
  "resolution_prefix_tuning": false,
  "scaling": "std",
  "self_attn": false,
  "self_attn_heads": 1,
  "transformers_version": "4.57.6",
  "use_decoder": true,
  "use_positional_encoding": false
}
